In [1]:
import pandas as pd

In [11]:
#Define a dictionary 'x'

x = {'Student':['David', 'Samuel', 'Terry', 'Evan'],
     'Age':['27', '24', '22', '32'],
     'Country':['UK', 'Canada', 'China', 'USA'],
     'Course':['Python','Data Structures','Machine Learning','Web Development'],
     'Marks':['85','72','89','76']}
df = pd.DataFrame(x)
df

  Student Age Country            Course Marks
0   David  27      UK            Python    85
1  Samuel  24  Canada   Data Structures    72
2   Terry  22   China  Machine Learning    89
3    Evan  32     USA   Web Development    76

In [12]:
#Retrieving the "ID" column and assigning it to a variable x
x = df[['Age']]
x

  Age
0  27
1  24
2  22
3  32

In [13]:
#check the type of x
type(x)

pandas.core.frame.DataFrame

In [15]:
#Retrieving some columns as a data frame
z = df[['Age','Country']]
z

  Age Country
0  27      UK
1  24  Canada
2  22   China
3  32     USA

In [16]:
type(z)

pandas.core.frame.DataFrame

In [18]:
#Get the Course column as a series, just one bracket
y = df['Course']
y

0              Python
1     Data Structures
2    Machine Learning
3     Web Development
Name: Course, dtype: object

In [19]:
type(y)

pandas.core.series.Series

In [21]:
# Access the value on the first row and the first column

df.iloc[0, 0]

'David'

In [22]:
# Access the value on the first row and the third column

df.iloc[0,2]

'UK'

In [30]:
# Access the value using number for row and column using the name

df.loc[2, 'Course']

'Machine Learning'

In [88]:
#Create a new dataframe called 'df2' and assign 'df' to it. 
#Now, let us set the "Course" column as an index column using the method set_index().
df2=df
df2=df2.set_index("Course")

In [89]:
df2.head()

                 Student Age Country Marks
Course
Python             David  27      UK    85
Data Structures   Samuel  24  Canada    72
Machine Learning   Terry  22   China    89
Web Development     Evan  32     USA    76

In [90]:
df2.loc['Python','Student']

'David'

In [91]:
# let us do the slicing using old dataframe df

df.iloc[0:2, 0:3]

  Student Age Country
0   David  27      UK
1  Samuel  24  Canada

In [92]:
#let us do the slicing using loc() function on old dataframe df where index column is having labels as 0,1,2
df.loc[0:2,'Student':'Country']

  Student Age Country
0   David  27      UK
1  Samuel  24  Canada
2   Terry  22   China

In [94]:
df.loc['David':'Terry', 'Student':'Marks']

Empty DataFrame
Columns: [Student, Age, Country, Course, Marks]
Index: []

In [81]:
df2

  Student Age Country            Course Marks
0   David  27      UK            Python    85
1  Samuel  24  Canada   Data Structures    72
2   Terry  22   China  Machine Learning    89
3    Evan  32     USA   Web Development    76

##